---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarIllegalBarType
source: html/d435fca1-4fb0-f273-f3c9-3da0f4ddbb05.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarIllegalBarType Property

There is Structural Rebar present in the project that no longer meet the criteria defined in Allowable Rebar Bar
 types parameter. Please review all existing Structural Rebar created with this Shape.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarIllegalBarType { get; }
```